run/benchmark/acceleration/DTCHull/DTCHull/system/simulationParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      simulationParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DDTSCHEME         localEuler;
CFL               10;
AlphaCFL          5;  
SOLVER            interFoam;
ENDTIME           4000;
DELTAT            1;
WRITEINTERVAL     100;

// ************************************************************************* //
